Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 年轻道长脸色沉重。
en_us: A grim look appeared on the young Daoist priest's face upon hearing this.

source: 年轻门房原先打的小算盘，当然是想着白拿一枚铜钱，又不用担风险，而且拿得心安理得。
en_us: If the steward were to refuse to grant Chen Ping'an entry, then the proter would be able to keep that one copper coin without accepting any risk, and he could also say that he had done everything he could, so he would have a clear conscience as well.

source: 年迈掌柜看着这个敲上去差不多岁数的老头子，摇摇头，端起茶碗，叹了口气道：“今儿给阮师那边看了位病人，是个姓刘的少年，给外乡人一拳打了个打半死，我这心里不得劲儿，就想着来你这边坐坐，缓一缓。”
en_us: The elderly shopkeeper and the old man appeared to be around the same age, and the former shook his head, then picked up the teacup as he sighed, "I was called by Master Ruan to tend to a patient. It was a boy with the Liu surname, and he was almost punched to death by an outsider. I still feel really bad about all of this, so I thought I'd come here and have a chat with you to put me in a better mood."

source: 年迈管事汗如雨下。
en_us: Sweat poured down the old man's back.

source: 年迈管事连忙摆手，“不敢当不敢当，职责所在，叨扰崔先生了。”
en_us: The elderly steward hurriedly waved his hands as he said, "I wouldn't dare to accept your gratitude, Mr. Cui. I am just performing my duty. Please pardon my instrusion."

source: 年迈管事默然点头，放缓脚步，然后悄然离去。
en_us: The old steward nodded in acknowledgment. He slowed down his pace before silently taking his leave.

source: 年迈老人赶紧弯腰惶恐道：“正是福禄街的宋家。”
en_us: The old man hurriedly bowed and said in fear, "The Fortune Street's Song Clan."

source: 并无人影。
en_us: However, there was noone to be seen.

source: 座繁华千年的安详小镇，不曾想到最后，皆是没有来生来世的可怜人。
en_us: This was a peaceful town that had prospered for thousands of years. In the end, however, it would unexpectedly become a town whose pitiful residents would enjoy no reincarnation.

source: 庭院深深处，有位赤脚老人沧桑老人推门而出，站在院子里跳脚怒骂道：“是哪个王蛋在谋害我宋氏基业站出来战”
en_us: Deep inside the manor, a bare-foot old man pushed open the door of his room, then stormed out into the courtyard as he yelled, "Which bastard is plotting the downfall of our Song Clan? Come out and fight me right now!"

source: 廊桥中间那边随之有人冷哼一声。
en_us: This was followed by a cold harrumph form someone in the covered bridge, and Chen Ping'an abruptly awakened to find that he was still laying on the table in his house.

source: 廊桥北端桥头的台阶那边，人头攒动，议论纷纷，远远看着热闹，唯独不敢靠近那个少年，生怕惹祸上身。
en_us: On the northern end of the covered bridge, there stood a large group of people pointing and having spirited discussions. However, they didn't dare to approach the young boy, lest they bring calamity upon themselves.

source: 廊桥北端的台阶上，坐着四个人，姿态婀娜的丰腴美妇，怀里抱着一个大红袍子的男孩，他高高扬起下巴，像是一场刚刚获得大捷的将军，台阶那一头，坐着个满头霜雪的高大老人身边，老人正在小声安慰一位气鼓鼓的小女孩，她粉雕玉琢，宛如世上最精巧的瓷娃娃，她的稚嫩肌肤在阳光照耀下，晶莹剔透，以至于能够清晰看到皮肤下的一条条青筋脉络。
en_us: On of those was a beautiful and voluptuous woman who was holding a boy wearing a big red robe in her arms. His chin was raised up high as if he were a general that had just returned from a comprehensive victory in battle, while on the other side of the steps was an imposing old man with a head of white hair. The old man was in the process of consoling an angry little girl, whose skin was so fair and decliate that it was as if she were the more intricately crafted porcelain doll in this world. Her delicate skin was glittering and translucent under the son, to the point that one could even clearly see a series of fine veins under her skin.

source: 廊桥南端石阶上，坐着一位刀剑叠放的少女，面容肃穆。
en_us: On the stone steps on the southern end of the covered bridge sat a young woman with a solemn look on her face and a pair of blades laid across her lap.

source: 廊桥石阶上，独自坐着一位中年儒士，他枯坐到天明。
en_us: On the covered bridge, a middle-aged scholar was sitting alone. He would remain here until first light.

source: 廊桥这端悬挂一块金字匾额，是一块不知出自谁手笔的四字匾额，字极大，“风生水起。”
en_us: A plaque with four golden words was hanging on this side of the bridge, and it was unknown who had written these words. The words were extremely large, and they read, "Rising Winds Crashing Water".

source: 廊桥远处，那拨人在看到yi身寒酸相的草鞋少年识趣转身后，相视yi笑，也没有说话，生怕打破那位“同年”女子的玄妙“水观”心境。
en_us: The group of people on the covered bridge exchanged a smile upon seeing the impoverished young boy tactfuly turn around to leave. However, they didn't speak, afraid that they would disturb the young girl who was in a mystical mental state of "observing water".

source: 廊桥那边，台阶下，站着一名赤脚僧人，他脸庞方正，有坚韧刚毅之神色。
en_us: Before the steps leading onto the covered bridge, there stood a barefoot monk with a square face and an iron-willed expression.

source: 廊桥那边，高高挂着“风生水起”四字匾额。
en_us: On the covered bridge, the plaque reading "Rising Winds Crashing Water" hung high.

source: 开门之人，正是那位代表儒家来此讨要压胜之物的君子，年少时就赢得过呵笔郎的美誉，一直被视为下任观湖书院山主的不二人选。他看到两位年轻人之后，有惊喜也有讶异，望向其中一位斜靠门扉的年轻人，笑问道：“灞桥，你身边这位朋友是？”
en_us: The one who opened the door was none other than the man who had come here to take back the talisman on behalf of the school of Confucianism. Even from a young age, he had been the recipient of much praise, and he had always been seen as the undisputed heir to the position of master of the Lake View Academy. He was both surprised and elated to see the two young men, and he turned to one of them, who was leaning against the doorframe, then asked with a smile, "May I ask who your friend is, Baqiao?"

source: 弯腰蹚水的陈平安不断搬开、翻动溪底的大石块，已经捡了七八颗石子放入竹篓，大一不小，颜色各异，石子皮色有像秋天高挂枝头的金黄橘子，也有白皙细嫩得像是婴儿的肌肤，还有一团漆黑，而且黑的发亮，还有鲜艳得像是大红桃花，又以虾背青的颜色最多，不一而足。
en_us: Bending down in the creek, Chen Ping'an continued to flip around and move aside the larger rocks on the bottom. He had already collected seven or eight pebbles and placed them in his bamboo basket. They varied in size and color, with some pebbles appearing as golden-orange as the tangerines in autumn, while others appeared as white and smooth as the skin of an infant. There was also a pebbled so pitch-black that it almost glowed, and a pebble that appeared as bright as a large red peach blossom. No two pebbles looked the same.

source: 归根结底，半路结盟的朋友，比不得一家人。
en_us: Ultimately, they were just temporary allies, so they weren't all that close with one another.

source: 归根结底，在于她自己就很焦躁，按照她的性情，这会儿本该杀向那个正阳山老猿了，如今却要反过来苦口婆心劝说少年不要冒险，这是有违本心的。但问题在于，就像她自己所说，大势所趋，确实易静不易动，这也是她的直觉。
en_us: This agitation came solely from herself. Given her personality, she would've normally already beeing going after Bai Yuan of the Sun Scorch Mountain herself, yet now, she had to try and convince Chen Ping'an not to take undue risks, and that completely went against her character. However, the problem was that just as she had said, this was not the time to be doing something reckless, and her intuition told her that the consequences of any reckless actions were going to be particularly severe at this sensitive time.

source: 当一次捶打之后，千万点火星，骤然间在屋内全部停滞。
en_us: When the hammer fell again, tens of millions of sparks abruptly froze in midair, lingering all over the room.

source: 当中年儒士身影消失在小巷尽头，少女顿时浮现出满脸不屑，狠狠呸了一声。
en_us: As Qi Jingchun left the alley and vanished out of sight, a derisive sneer immediately appeared on Zhi Gui's face as she spat disdainfully onto the ground.

source: 当了一段时间飘来荡去的孤魂野鬼，少年实在找不到挣钱的营生，靠着那点微薄积蓄，少年勉强填饱肚子，前几天听说几条街外的骑龙巷，来了个姓阮的外乡老铁匠，对外宣称要收七八个打铁的学徒，不给工钱，但管饭，陈平安就赶紧跑去碰运气，不曾想老人只是斜瞥了他一眼，就把他拒之门外，当时陈平安就纳闷，难道打铁这门活计，不是看臂力大小，而是看面相好坏？
en_us: After drifting around aimlessly for a while, he was unable to find any sources of income. He was only just barely able to feed himself with his meager savings, and a few days ago, he heard that a foreign blacksmith with the surname of Ruan had arrived in Dragon Riding Alley, an alley that was a few streets away. The old blacksmith had declared that he was planning to take seven or eight disciples, and no wages were provided, but meals were ensured. Chen Ping'an had immediately gone to try his luck, but to his dismay, the old blacksmith only took a side glance at him before turning him away. At the time, Chen Ping'an had felt quite perplexed. Could it be that blacksmithing didn't rely on the strength of one's arm, but the charm of one's looks instead?

source: 当他临近青色石崖，突然停下脚步，因为他清晰看到不少人站在那边，每人容颜几乎纤毫毕现，之所以如此，并非星光璀璨的缘故，而是那座青牛背上，站着一头雪白麋鹿，通体晶莹，焕发出丝丝缕缕的白色光线，如同小溪里随水摇晃的水草。
en_us: When he arrived near the green stone cliff, he suddenly stopped in his tracks. This was because he could clearly see several people standing there, each of their appearances as clear as could be. This wasn't because they were being illuminated by the stars in the night sky. Instead, it was becase a crystal-like white deer that was radiating with rays of white light was standing on the Azure Cow Ridge beside them. The rays of light wavered like the waterweeds in the creek.

source: 当他刚要说出姓名，妇人立即捂住孩子嘴巴，“出门前，你爹与你叮嘱过多少次了，在这里，不可轻易对谁指名道姓。”
en_us: He was just about to state a name when the woman hurriedly clasped a hand over his mouth. "Don't refer to people directly by their names unless it's necessary! Your father told you that many times before we came here."

source: 当他想要跟老天爷讨要一个公道的时候，就更像一条狗了。
en_us: When he wanted to demand justice from the heavens, he would appear even more like an old dog.

source: 当他看到年轻道姑缓缓走来，陈平安有些头大，少年现在实在是不愿和这些来自外乡的神仙打交道。
en_us: Chen Ping'an was slightly at a loss as he saw the Daoist nun slowly walking toward him. He truly didn't want to interact with these immortals from the outside world at this moment.

source: 当务之急，陈平安是需要yi门能够细水流长、滋养元气的武学，这门武学是不是招式凌厉、霸道绝伦，是不是让人武道境界yi日千里，反而不重要。
en_us: The most important thing right now was for him to learn a martial art that could provide him with small benefits over a long period of time, allowing him to nurture his vital energy. In terms of whether this martial art was powerful, domineering, or could allow one to progress in leaps and bounds, this was all of much less importance.

source: 当天开青白出现第一缕曙光，他抬头望去，轻声笑道：“千年暗室，一灯即明。”
en_us: When the first ray of light peeked over the horizon, he looked up and said with a faint smile, "A dark room for a thousand years, a room illuminated with a single light[ref]This is an allusion to the Buddhist concept of avidya and vidya.[/ref]."

source: 当头一拳。
en_us: This was a punch aimed at his head.

source: 当她刚刚走入一条不知名巷弄。
en_us: She had only just made her way into a nameless alley when a certain object suddenly flew through the air, then stopped obediently behind her before ringing incessantly.

source: 当她听到脚步后，笑容腼腆地站起身，看到并肩而立的草鞋少年和绿袍少女，扎了一根马尾辫的少女，略显局促不安。陈平安不敢再把眼前这位名叫阮秀的姑娘，当成普普通通的少女看待，当然，少女最让他印象最深的形象，依然是坐吃山空四个字。
en_us: When Ruan Xiu heard the footsteps behind her, she stood up with a bashful smile and turned around to look at Chen Ping'an and Ning Yao, who were standing side-by-side. Ruan Xiu felt a little self-conscious and uneasy at the moment. Meanwhile, Chen Ping'an didn't dare to treat Ruan Xiu like she was an ordinary girl anymore. Of course, his strongest impression of her was still the fact that she could defeat an entire mountain of food.

source: 当她推开院门后，一条粗看不起眼的四脚蛇，不知道从哪个旮旯角落窜出，飞快爬到她脚边，给她气呼呼地一脚踢飞。
en_us: As soon as she opened the gate of Song Jixin's courtyard, an unremarkable-looking four-legged snake rushed out of a corner before quickly scurrying over to her feet, only to be kicked aside by her in a fit of anger.

source: 当宋集薪从内屋拿出一样东西，放在桌上，苻南华不管如何掩饰，都藏不住脸上的狂喜。
en_us: Song Jixin pulled out an item from his large red chest before placing it onto the table, and no matter how much Fu Nanhua tried to disguise it, he was unable to hide the elation on his face.

source: 当宋集薪带着稚圭来到学塾后院，凉风习习，文质彬彬的青衫少年郎如往常一般，已经坐在了南边的凳子上，腰杆挺直，正襟危坐。
en_us: As Song Jixin arrived in the yard behind the private school, there was a cool breeze, and as usual, the scholarly azure-robed young boy was already seated on the stool to the south with a serious expression and his back ramrod straight.

source: 当少年跃下最后一座屋顶，落地之时，双膝弯曲，巧妙卸去一部分下坠力道，快速扭头瞥了眼后方景象，继续弓腰前冲。
en_us: As Chen Ping'an jumped off the final rooftop to land on the ground, he bent his knees slightly to buffer the force of the impact, then quickly took a glance behind him before continuing to charge ahead at full speed.

source: 当年轻道姑牵起小女孩的手，一起走下青牛背，通灵的白鹿尾随其后，不仅仅是同门师弟的年轻道人感到匪夷所思，那位腰佩虎符、背负长剑的兵家巨子，也流露出惊讶之色。
en_us: When the young Daoist nun led the little girl down the Azure Cow Ridge, with the white deer following behind them, not only was her Junior Brother stunned, but even the man with a sword strapped to his back and a tiger talisman hanging by his waist was astonished.

source: 当年迈宦官发现少女用棉布包扎的受伤双手，忍不住眉头紧皱。
en_us: The elderly eunuch's brows furrowed slightly as he noticed the young woman's hands, which had been bandaged with strips of cotton cloth.

source: 当时他以为齐先生是担忧泥瓶巷少年毙命，事后才发现根本不是那么一回事。
en_us: At that time, the swordsman had thought that Mr. Qi was worried about Chen Ping'an being killed. Only afterward did he realize that this wasn't the case at all.

source: 当时刘羡阳自吹自夸的时候，不小心被路过的姚老头听到，yi直对刘羡阳青眼相加、视为得意弟子的老人，不知道少年哪句话戳中了老人伤心处，姚老头破天荒勃然大怒，追着刘羡阳就是yi顿暴揍。反正在那之后，刘羡阳再也没有说过“天才”两个字。
en_us: While bragging and blowing his own trumpet, Liu Xianyang had accidentally been overhead by the passing Old Man Yao. Old Man Yao had always given him special treatment and viewed him as a favorite disciple, yet Liu Xianyang's words had seemingly caused him to recall some unpleasant memories. In a rare display, Old Man Yao had flared up in rage and given Liu Xianyang a solid beating. After that time, Liu Xianyang never mentioned the word "prodigy" again.

source: 当时在小街上，雨水渐歇，宁姚转头看着气息平稳、神态从容的陈平安，虽然她内心不喜欢杨老头的，但不得不承认那个老人，是真正的世外高人。
en_us: The rain gradually subsided as Ning Yao and Chen Ping'an walked along the street. Ning Yao turned around to look at Chen Ping'an, whose breathing was now calm and expression was now relaxed. Even though she disliked Old Man Yang, she had to admit that he was indeed a skillful person who was living in recluse.

source: 当时在少女后背醒来后，大概是药效褪去，其实当时就已经开始发作，只是陈平安觉得可以撑一撑，等到宁姚背着他到廊桥附近，他知道是如何也撑不下去了，于是宁姚甚至顾不得取回溪边道路中的那柄刀，就赶紧背着他赶往杨家铺子。
en_us: When he had woken up on Ning Yao's back, he had already started to feel some pain most likely because the effects of the medicine had already worn off. However, Chen Ping'an had felt like he could still endure it for a little while. When they reach the covered bridge, though, he knew that he wouldn't be able to endure his wounds for much longer. Thus, Ning Yao hadn't even had the time to retrieve her saber by the creek, and she had immediately carried him and rushed over to the Yang Family's medicine shop.

source: 当时的宋集薪全然不怕，反而乐滋滋地蹲在墙头上看热闹，唯恐天下不乱。
en_us: At the time, not only was Song Jixin not frightened by this horrific scene, he was watching with glee as he squatted on top of the wall, reveling in the chaos of the situation.

source: 当时阮秀在不远处愣愣看着这一幕，偷偷吃着让陈平安帮忙从小镇买来的碎嘴吃食。
en_us: At the time, Ruan Xiu had been dazedly observing them from nearby, secretly enjoying the snacks that Chen Ping'an had helped her buy from the small town as she did so.

source: 当然一切的前提是，自己不要被人一个照面就一拳打死了。
en_us: Of course, in order to accomplish this, the first thing that he had to do was ensure that he wasn't killed by a single punch.

source: 当然不能。
en_us: To no one's surprise, he was met with no response.

source: 当然了，在美妇人和魁梧白发老人的广袤世界里，数量最多的，也正是这种人。
en_us: Of course, in the vast world that the woman and the old man were part of, there was also no lack of cultivation prodigial talents of Liu Xianyang's caliber.

source: 当然前提是陈平安这个家伙，没有让少女觉得讨厌，相反还有一些好感，或者说对陈平安的认同。
en_us: Of course, the prerequisite to receiving this kindness was the fact that Ruan Xiu didn't dislike Chen Ping'an. Not only that, but she even had a fairly good impression of him. In other words, she approved of Chen Ping'an.

source: 当然话要说回来，莫说只有她宁姚的yi分神似，就算有七八分，宁姚也不会觉得如何惊才绝艳。
en_us: Of course, to say nothing of emulating 10% of her aura, Ning Yao wouldn't be astonished even if someone managed to emulate 80% of her aura.

source: 当然这些话，她爹是绝不敢跟她娘当面说的。
en_us: Of course, her father didn't dare to utter these words before her mother.

source: 当然陈平安也做得到，只是会很辛苦，耗时耗力远远超过刘羡阳。
en_us: Of course, Chen Ping'an was also capable of doing this as well. However, it was far more difficult for him, and it would take him much more time and effort than Liu Xianyang.

source: 当然，也有盛产清谈名士和荒诞狂士的南涧国，以言行不拘泥于礼仪，著称于世。
en_us: Of course, there was also the Southern Stream Nation that was renowned for producing impractical and absurd scholars. These were scholars who were well-known for their unrestrained speech and strict adherence to rules.

source: 当然，事无绝对。就像马苦玄之前差点死于陈平安之手，男人就出手救下了马苦玄，原因有两个，一个是内心深处不希望马苦玄这样的天才，过早夭折，希望马苦玄能够在真武山砥砺一番，无论是天赋还是性情，都更上一层楼，希望少年能够成为兵家代表人物之一，在接下来的大争乱世之中，大放异彩。另一个是齐先生主动开口，说马苦玄和陈平安两位少年，分出胜负就行了，切莫分出生死。
en_us: Of course, nothing was absolute. For example, the swordsman had stepped forward to save Ma Kuxuan when he had almost been killed by Chen Ping'an. There had been two reasons for this. Firstly, the swordsman hoped that a prodigy like Ma Kuxuan wouldn't die too early. He wanted Ma Kuxuan to temper both his talent and temperament in True Martial Mountain, such that he could reach a greater height. At the same time, he also wanted Ma Kuxuan to become one of the representatives for the Martial Sect, such that he could display his power and brilliance in the coming age of turbulence. Secondly, Mr. Qi had personally said that Ma Kuxuan and Chen Ping'an should only go as far as to determine a victor between them. They shouldn't go as far as to kill each other.

source: 当然，后来刘羡阳看上了宋集薪的婢女稚圭，莫名其妙就深陷其中，在那之后，高大少年好像眼里头就再没有其她的漂亮女子了。哪怕此时此刻跟黑衣少女摆阔绰，也更多是希望傲气冷漠的少女，不要小看他，别以为挎着刀提着剑，就能拽得天王老子似的，我刘羡阳的这件传家宝，那也是小镇独一份。
en_us: Of course, Liu Xianyang fell for Zhi Gui afterward, and he mysteriously became enchanted by her. From that moment onward, it was as if there were no other woman who could attract his attention. Even though he was acting all generous and extravagant before Ning Yao, this was more so in the hopes that the aloof young woman wouldn't underestimate him. He wanted to show her that she wasn't the boss just because she wielded a saber and a sword. He, Liu Xianyang, also had a suit of armor that couldn't be found anywhere else in the small town.

source: 当然，小巷除了主仆二人，真正的外人，也就只有两个。
en_us: Aside from the boy, the old man, and the young woman, there was only one more person on the small alley, and it was a masked man with a tall and thin figure, but his arms were extremely well-built, with bulging muscles that resembled steel balls.

source: 当然，老猿不是瞎子更不是傻子，在自己本命飞剑将出欲出之际，护山猿肯定已经察觉到自己的存在。
en_us: Of course, Bai Yuan wasn't an idiot. In the instant that Liu Baqiao's bonded flying sword had almost flown out of its scabbard, Bai Yuan had to have definitely already detected his presence.

source: 当然，这渡劫之法，并无定理定数定势，一切需要当局者自行解谜破局。
en_us: Of course, there was no set method to transcending these tribulations, and it was required for the transcender to work out solutions on their own.

source: 当然，陈平安内心也希望能够那位宁姑娘，在他家里把伤养好了，只不过当时少年没敢说出口，怕被她认为是轻薄。
en_us: Of course, Chen Ping'an also wished that Ning Yao could stay at his home until she fully recovered from her wounds. However, he hadn't dared to say this out aloud, afraid that she would take it the wrong way.

source: 当真就没有线生机吗
en_us: Was there truly not even a sliver of a hope?

source: 当老人说到“急”这个字眼的时候，帷帽少女已经走出去二十余步。
en_us: At this point, the young woman in the veiled hat was already over 20 meters away from them.

source: 当苻南华看到黝黑少年的那双眼眸，他突然冷静下来。
en_us: As Fu Nanhua looked into Chen Ping'an's eyes, he quickly calmed down.

source: 当草鞋少年坐在身边，伸手抓住高大少年的一只手，视线早已模糊的刘羡阳，好像一下子多出几分精神气，试图挤出一个笑脸，断断续续说道：“那婆娘说我不交出宝甲，她就能杀了你……她还说，反正她是母子两个人来咱们小镇的，一人被驱逐而已，这个代价她出的起，我怕，很怕她真的去杀你……之前我跟你说的，其实不全是假话，我爷爷的确跟我说过那些话，所以我觉得卖了就卖了，没啥大不了的……只是刚才她又让人去找我，说那个老人疯了，一听说我没有剑经，就执意要先杀你，再来杀我，我实在是担心你，想给你打声招呼……就一路跑到这里，然后就被那老王八蛋打了一拳，是有点疼……”
en_us: When Chen Ping'an sat down beside Liu Xianyang and grabbed one of his hands, it was as if the tall young boy whose vision was already blurry regained a little bit of energy. He tried to squeeze out a smile, and he said in a labored voice, "That woman said that she would kill you if I didn't give her the suit of treasured armor... She also said that both she and her son had come to our small town, so she could accept the price of one of them being kicked out. I was afraid... I was genuinely afraid that she would kill you... However, I didn't lie to you before, and my grandpa truly did say those words. So, I decided to sell the suit of armor. What does it matter anyway...? "However, she sent someone to look for me just then, and they told me that the old man had gone crazy. After hearing that I didn't have the sword scripture, he became intent on killing you and then killing me. I was extremely worried about you, so I wanted to run over to give you a warning... That's how I arrived here... However, I was punched by that old bastard... It does hurt a little."

source: 当那个少年误食草药而在小巷，而绞痛得满地打滚的时候，那种执念，甚至能够让一个原本该在乡塾蒙学的孩子，想着便是爬也爬回家中，要将那竹篓救命草药放回家中。
en_us: Back when Chen Ping'an had been rolling around in agony after eating the wrong the medicinal herb, he had only been at the age where he should've been attending school with all the other children, but even back then, it was this very same urge that had driven him to crawl back home in order to deliver that bamboo basket full of life-saving medicinal herbs.

source: 当陈平安停下后滚势头的瞬间，不知不觉，有意无意，整个人变成了单膝跪地、弯腰助跑的姿势。
en_us: When Chen Ping'an finally stopped rolling, he landed in a half-kneeling position with his knees bent and his body leaning forward, preparing him for a forward thrust. It was hard to say whether this was on purpose.

source: 当陈平安和宁姚走到廊桥南端，看到一位马尾辫的青衣少女坐在台阶顶，双手托起腮帮凝视远方，留给两人一个背影。
en_us: When Chen Ping'an and Ning Yao arrived on the southern end of the covered bridge, they saw a girl with a ponytail and dressed in green sitting on top of the stairs, with her hands on her cheeks as she gazed into the distance. She was sitting with her back facing them.

source: 当陈平安用石头在地面刻出两个字后，阮秀摇身一变，神采飞扬，自信笑道：“这两个字啊，太简单了，我很小就晓得它们了，一个神字，一个庭字，合在一起，就是一个人体穴位的称呼，神庭，所谓的窍穴，我们人之所以是万灵之长，许多修成大道的精魅妖物，最后不得不幻化为人，就在于人之身躯最适合修行，三百六十五座大小窍穴，皆是金山银山似的宝藏，古人有云，窍穴，即是神气之所游行出入也，我们人的三魂六魄，就像是吃百家饭的小孩子，这家里吃一碗饭，那家里喝一碗水，然后不断温养孕育，成长壮大。”
en_us: Chen Ping'an carved out a couple of characters onto the ground with the sharp rock, and as soon as Ruan Xiu saw the two characters, her feigned confidence immediately turned to genuine confidence as she said in an elated manner, "These two characters are way too simple! I already knew them from a very young age. One of them is 'divine', while the other is 'court', and when put together, they spell out the name of an acupoint on the human body. The reason why us humans are known as the rulers of all sentient beings is because our bodies are most suitable for cultivation. It's also because of this that many monsters and demons that attain the Great Dao have no choice but to manifest human forms at some point in their cultivation journey. The 365 acupoints in the human body are all like mountains of treasures. There's an ancient saying that acupoints are the avenues through which divine energy enter and exit the body, and our soul is like a child who was able to grow up thanks to the kindness and charity of others, being spared a bowl of rice by one family, then a bowl of water by another, slowly developing and becoming stronger."

source: 当陈平安瞪大眼睛，依稀看到一点光亮后，那一瞬间，他就失去了知觉。
en_us: He could spot a glimmer of light in the water, but in the next instant, he abruptly lost consciousness.

source: 当齐静春说出这个字后，与此同时，若是有人恰好抬头，就可以看到天穹之顶，骤然出现一点米粒之光，然后一根极其纤细的金线从天而降，转瞬之间落在小镇内。
en_us: Right after Qi Jingchun said this... If someone coincidentally looked up at this moment, they would see a speck of light suddenly appear in the sky before instantly shooting down into the small town and leaving a thin trail of golden light behind it.

source: 往不知天高地厚的少女扑杀而去。
en_us: He charged at the impudent young girl.

source: 很久之后，陈平安转头笑道：“要是姑娘不嫌弃，就住在这里好了。需要什么，只管说。”
en_us: A long while later, Chen Ping'an turned to Ning Yao with a smile as he said, "If you don't mind, you can live here. Just tell me if you need anything."
